# Задание 4.

# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и только арифметические операции.
# Не используйте взятие по индексу.

# Пример:
# Ведите целое положительное число: 123456789
# Самая большая цифра в числе: 9

import math
number = abs(int(input('Введите число: ')))
max_value = number % 10
while number > 0:
    number /= 10
    if max_value <= number % 10:
        max_value = number % 10

print(math.trunc(max_value))
